app/views/mixtapes/new.html.erb

SELECT "songs".* FROM "songs"
---
    <select name="mixtape[song_ids_to_add][]">
      <% Song.all.each do |song| %>