app/views/mixtapes/show.html.erb

<ol>
  <% @mixtape.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" INNER JOIN "mixtape_songs" ON "songs"."id" = "mixtape_songs"."song_id" WHERE "mixtape_songs"."mixtape_id" = ?  [["mixtape_id", 2]]


<% if @mixtape.users.count > 1 %>
---
SELECT "users".* FROM "users" INNER JOIN "user_mixtapes" ON "users"."id" = "user_mixtapes"."user_id" WHERE "user_mixtapes"."mixtape_id" = ?  [["mixtape_id", 4]]
SELECT COUNT(*) FROM "users" INNER JOIN "user_mixtapes" ON "users"."id" = "user_mixtapes"."user_id" WHERE "user_mixtapes"."mixtape_id" = ?  [["mixtape_id", 4]]