app/controllers/mixtapes/songs_controller.rb

SELECT "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = ? LIMIT 1  [["id", "4"]]
---
  def new
    @mixtape = Mixtape.find(params[:mixtape_id])