app/controllers/mixtapes_controller.rb

INSERT INTO "mixtape_songs" ("created_at", "mixtape_id", "song_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 13 Nov 2013 18:43:28 UTC +00:00], ["mixtape_id", 2], ["song_id", 1], ["updated_at", Wed, 13 Nov 2013 18:43:28 UTC +00:00]]
INSERT INTO "mixtapes" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 13 Nov 2013 18:43:28 UTC +00:00], ["name", "Autumn Bombs"], ["updated_at", Wed, 13 Nov 2013 18:43:28 UTC +00:00]]
INSERT INTO "songs" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 13 Nov 2013 18:43:28 UTC +00:00], ["name", "Furry Boots"], ["updated_at", Wed, 13 Nov 2013 18:43:28 UTC +00:00]]
---
  def create
    @mixtape = Mixtape.new(mixtape_params)


    params[:mixtape][:songs_attributes].each do |index, song_param|
      new_song = Song.new(song_param)
      @mixtape.mixtape_songs.build(:song => new_song)
    end

    if @mixtape.save

SELECT "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @mixtape = Mixtape.find(params[:id])