app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    @songs = Song.all

INSERT INTO "songs" ("artist_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["artist_id", 1], ["created_at", Tue, 05 Nov 2013 21:07:37 UTC +00:00], ["name", "Billie Jean"], ["updated_at", Tue, 05 Nov 2013 21:07:37 UTC +00:00]]
---
  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save

UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = 1  [["artist_id", 1], ["updated_at", Tue, 05 Nov 2013 21:01:08 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @song.update(song_params)

DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 1]]
---
  def destroy
    @song.destroy

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_song
      @song = Song.find(params[:id])