app/controllers/user_mixtapes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'listener@flatironschool.com' LIMIT 1
SELECT "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "user_mixtapes" ("created_at", "mixtape_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 13 Nov 2013 19:42:28 UTC +00:00], ["mixtape_id", 4], ["updated_at", Wed, 13 Nov 2013 19:42:28 UTC +00:00], ["user_id", 2]]
---
  def create
    user = User.find_by(:email => params[:email])
    mixtape = Mixtape.find(params[:id])
    UserMixtape.create(:user_id => user.id, :mixtape_id => mixtape.id)